[
  {
    "title": "‘My family is having a crisis’: My mom added my brother to her mortgage. He stopped paying. How does she get him off it?",
    "description": "“He refuses to take their names off the mortgage without getting paid.”",
    "link": "https://www.marketwatch.com/story/my-family-is-having-a-crisis-my-mom-added-my-brother-to-her-mortgage-he-stopped-paying-how-does-she-get-him-off-it-960f55b0?mod=mw_rss_topstories",
    "pub_date": "2025-10-18 22:20:00",
    "source": "https://feeds.marketwatch.com/marketwatch/topstories/",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "‘My family is having a crisis’: My mom added my brother to her mortgage. He stopped paying. How does she get him off it? “He refuses to take their names off the mortgage without getting paid.”"
  },
  {
    "title": "Singapore Law Firm to Sue Switzerland Over Asia Losses on AT1s",
    "description": "One of Singapore’s biggest law firms is set to file claims against the Swiss government by the end of the year, seeking compensation for hundreds of Asian bondholders of Credit Suisse AT1 debt that was wiped out in 2023.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-19/singapore-law-firm-to-sue-switzerland-over-asia-losses-on-at1s",
    "pub_date": "2025-10-19 06:18:31",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Singapore Law Firm to Sue Switzerland Over Asia Losses on AT1s One of Singapore’s biggest law firms is set to file claims against the Swiss government by the end of the year, seeking compensation for hundreds of Asian bondholders of Credit Suisse AT1 debt that was wiped out in 2023."
  },
  {
    "title": "Australia Prime Minister to Meet Trump With Rare Earths in Focus",
    "description": "Australian Prime Minister Anthony Albanese is expected to meet US President Donald Trump on Monday in Washington for talks that will include discussions over the supply chain of rare earth materials.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-19/australia-prime-minister-to-meet-trump-with-rare-earths-in-focus",
    "pub_date": "2025-10-19 04:52:43",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Australia Prime Minister to Meet Trump With Rare Earths in Focus Australian Prime Minister Anthony Albanese is expected to meet US President Donald Trump on Monday in Washington for talks that will include discussions over the supply chain of rare earth materials."
  },
  {
    "title": "Bubble Debate Drives Korean Retail Investors to Risky VIX Bets",
    "description": "Investors in South Korea looking to hedge their big US stock holdings or play their next wager are embracing a new type of trades: leveraged VIX bets.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-19/bubble-debate-drives-korean-retail-investors-to-risky-vix-bets",
    "pub_date": "2025-10-19 00:00:00",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": -1.0,
    "sentiment_label": "bad",
    "analysis_text": "Bubble Debate Drives Korean Retail Investors to Risky VIX Bets Investors in South Korea looking to hedge their big US stock holdings or play their next wager are embracing a new type of trades: leveraged VIX bets."
  },
  {
    "title": "Protesters Oppose Trump in ‘No Kings’ Event in NYC",
    "description": "Demonstrators across the US turned out for what organizers said would be more than 2,600 “No Kings” protests across the US to express their opposition to President Donald Trump’s agenda. (Source: Bloomberg)",
    "link": "https://www.bloomberg.com/news/videos/2025-10-18/protesters-oppose-trump-in-no-kings-event-in-nyc",
    "pub_date": "2025-10-18 22:31:57",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Protesters Oppose Trump in ‘No Kings’ Event in NYC Demonstrators across the US turned out for what organizers said would be more than 2,600 “No Kings” protests across the US to express their opposition to President Donald Trump’s agenda. (Source: Bloomberg)"
  },
  {
    "title": "Global Finance Chiefs Wait on Trump and Xi as Trade War Simmers",
    "description": "After a week of talks dominated by trade spats and geopolitical distrust, finance chiefs were once again left hanging on the outcome of a potential meeting between the leaders of the world’s two largest economies.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-17/global-finance-chiefs-urged-to-keep-calm-as-trade-war-escalates",
    "pub_date": "2025-10-17 18:53:18",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 1.0,
    "sentiment_label": "good",
    "analysis_text": "Global Finance Chiefs Wait on Trump and Xi as Trade War Simmers After a week of talks dominated by trade spats and geopolitical distrust, finance chiefs were once again left hanging on the outcome of a potential meeting between the leaders of the world’s two largest economies."
  },
  {
    "title": "Subprime Lender PrimaLend’s Creditors Eye Bankruptcy Push",
    "description": "Creditors of PrimaLend, which provides financing to auto dealerships that cater to subprime borrowers, are weighing pushing the firm into bankruptcy after going unpaid for months, and as the industry reels from the recent downfall of Tricolor Holdings.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-17/subprime-lender-primalend-s-unpaid-creditors-eye-bankruptcy-push",
    "pub_date": "2025-10-17 17:45:40",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Subprime Lender PrimaLend’s Creditors Eye Bankruptcy Push Creditors of PrimaLend, which provides financing to auto dealerships that cater to subprime borrowers, are weighing pushing the firm into bankruptcy after going unpaid for months, and as the industry reels from the recent downfall of Tricolor Holdings."
  },
  {
    "title": "Protesters Take Part in A \"No Kings\" in Washington, D.C.",
    "description": "Protesters take part in a \"No Kings\" protest against President Donald Trump's policies in  Washington, D.C. (Source: Bloomberg)",
    "link": "https://www.bloomberg.com/news/videos/2025-10-18/protesters-take-part-in-a-no-kings-in-washington-d-c",
    "pub_date": "2025-10-18 16:44:07",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 1.0,
    "sentiment_label": "good",
    "analysis_text": "Protesters Take Part in A \"No Kings\" in Washington, D.C. Protesters take part in a \"No Kings\" protest against President Donald Trump's policies in  Washington, D.C. (Source: Bloomberg)"
  },
  {
    "title": "ECB’s Nagel Says Inflation Pretty Much on Target for Next Years",
    "description": "Euro-area inflation will probably meet the European Central Bank’s 2% goal over the coming years, according to Bundesbank President Joachim Nagel said.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/ecb-s-nagel-says-inflation-pretty-much-on-target-for-next-years",
    "pub_date": "2025-10-18 12:59:33",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "ECB’s Nagel Says Inflation Pretty Much on Target for Next Years Euro-area inflation will probably meet the European Central Bank’s 2% goal over the coming years, according to Bundesbank President Joachim Nagel said."
  },
  {
    "title": "Sold Out in India, Panic in London: How the Silver Market Broke",
    "description": "For months, Vipin Raina had been bracing for a stampede of buying from Indian customers loading up on silver to honor the Hindu goddess of wealth.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/sold-out-in-india-panic-in-london-how-the-silver-market-broke",
    "pub_date": "2025-10-18 12:42:43",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Sold Out in India, Panic in London: How the Silver Market Broke For months, Vipin Raina had been bracing for a stampede of buying from Indian customers loading up on silver to honor the Hindu goddess of wealth."
  },
  {
    "title": "ICICI Bank Beats Profit Forecast, Margins Under Pressure",
    "description": "ICICI Bank Ltd. posted better-than-expected earnings as India’s second-largest private lender benefited from healthy loan growth, even as margins remained under pressure.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/icici-bank-s-profit-beats-estimates-on-strong-loan-growth",
    "pub_date": "2025-10-18 10:01:19",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.6,
    "sentiment_label": "good",
    "analysis_text": "ICICI Bank Beats Profit Forecast, Margins Under Pressure ICICI Bank Ltd. posted better-than-expected earnings as India’s second-largest private lender benefited from healthy loan growth, even as margins remained under pressure."
  },
  {
    "title": "Defending the Argentine Peso and the Homeland",
    "description": "Larry Summers explains US intervention in Latin American currencies.",
    "link": "https://www.bloomberg.com/news/newsletters/2025-10-18/larry-summers-on-currency-intervention-and-dan-driscoll-on-the-future-of-war",
    "pub_date": "2025-10-18 12:00:01",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Defending the Argentine Peso and the Homeland Larry Summers explains US intervention in Latin American currencies."
  },
  {
    "title": "Argentina CEOs Strive to Surf Milei Volatility at Annual Retreat",
    "description": "A throng of Argentine business leaders who descended this week on a beach resort tried to leave behind the political and market turmoil gripping the country so they could ponder the future. Their efforts were near impossible to sustain.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/argentina-ceos-strive-to-surf-milei-volatility-at-annual-retreat",
    "pub_date": "2025-10-18 12:00:00",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": -1.0,
    "sentiment_label": "bad",
    "analysis_text": "Argentina CEOs Strive to Surf Milei Volatility at Annual Retreat A throng of Argentine business leaders who descended this week on a beach resort tried to leave behind the political and market turmoil gripping the country so they could ponder the future. Their efforts were near impossible to sustain."
  },
  {
    "title": "Crypto Miners Riding the AI Wave Are Leaving Bitcoin Behind",
    "description": "Shares of the large-scale computing outfits that make Bitcoin work are once again outperforming the original cryptocurrency, as more pivot to hybrid models built around artificial intelligence and high-performance computing.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/crypto-miners-riding-the-ai-wave-are-leaving-bitcoin-behind",
    "pub_date": "2025-10-18 12:00:00",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 1.0,
    "sentiment_label": "good",
    "analysis_text": "Crypto Miners Riding the AI Wave Are Leaving Bitcoin Behind Shares of the large-scale computing outfits that make Bitcoin work are once again outperforming the original cryptocurrency, as more pivot to hybrid models built around artificial intelligence and high-performance computing."
  },
  {
    "title": "Oil’s Long-Awaited Surplus Arrives on Billion-Barrel Flotilla",
    "description": "The best place to observe the shift taking place in global oil markets is at sea.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/oil-s-long-awaited-surplus-arrives-on-billion-barrel-flotilla",
    "pub_date": "2025-10-18 11:00:00",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "Oil’s Long-Awaited Surplus Arrives on Billion-Barrel Flotilla The best place to observe the shift taking place in global oil markets is at sea."
  },
  {
    "title": "Funds Sue Lingerie Firm, Trustee in UK Over Soured Debt Deal",
    "description": "A trio of investment funds are suing Dutch lingerie retailer Hunkemöller International BV and the trustee of its debt over claims that a transaction which saw fund Redwood Capital Management take over the company violated their creditor rights.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-17/funds-sue-lingerie-firm-and-trustee-in-uk-over-soured-debt-deal",
    "pub_date": "2025-10-17 16:23:10",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 1.0,
    "sentiment_label": "good",
    "analysis_text": "Funds Sue Lingerie Firm, Trustee in UK Over Soured Debt Deal A trio of investment funds are suing Dutch lingerie retailer Hunkemöller International BV and the trustee of its debt over claims that a transaction which saw fund Redwood Capital Management take over the company violated their creditor rights."
  },
  {
    "title": "Germany’s Army Revival Runs Up Against an Acute Housing Shortage",
    "description": "For the past decade, the city of Heidelberg in southern Germany worked to transform a former US army base into a buzzing neighborhood for 10,000 residents and thousands of new jobs, with a vision to create a “unique new district that shines beyond the region.”",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/germany-s-army-revival-runs-up-against-an-acute-housing-shortage",
    "pub_date": "2025-10-18 05:00:00",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 1.0,
    "sentiment_label": "good",
    "analysis_text": "Germany’s Army Revival Runs Up Against an Acute Housing Shortage For the past decade, the city of Heidelberg in southern Germany worked to transform a former US army base into a buzzing neighborhood for 10,000 residents and thousands of new jobs, with a vision to create a “unique new district that shines beyond the region.”"
  },
  {
    "title": "China Rare-Earth Product Exports Shrink as US Frictions Flare",
    "description": "China’s exports of rare earth products fell in September from a month earlier, as Beijing’s tighter controls on strategic minerals ripple through global supply chains and heighten tensions with Washington.",
    "link": "https://www.bloomberg.com/news/articles/2025-10-18/china-rare-earth-product-exports-shrink-as-us-frictions-flare",
    "pub_date": "2025-10-18 04:14:34",
    "source": "https://feeds.bloomberg.com/markets/news.rss",
    "ticker": "NVDA",
    "company_name": "NVIDIA Corporation",
    "sentiment_score": 0.0,
    "sentiment_label": "neutral",
    "analysis_text": "China Rare-Earth Product Exports Shrink as US Frictions Flare China’s exports of rare earth products fell in September from a month earlier, as Beijing’s tighter controls on strategic minerals ripple through global supply chains and heighten tensions with Washington."
  }
]